Tekla Open API Reference for Tekla Structures 2025
AlongLinePlacingType Class
 The AlongLinePlacingType class defines a placing type that places the object using the along line placing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.AlongLinePlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class AlongLinePlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class AlongLinePlacingType
	Inherits PreferredPlacingTypeBase
The AlongLinePlacingType type exposes the following members.
Constructors
Name | Description
AlongLinePlacingType
 Creates a new along line placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace